


export const articles = [{
    'title': '关于书屋',
    'content': '8月初就开始着手开发书屋的一些功能，因为工作的原因，进度还是有点慢。之所以想弄一个书屋，是觉得自己记忆力不太好，知识也有点匮乏，过去看过的书过一个星期就不记得讲的什么，我需要记录读书的感想，记录看书给我带来的精神共鸣。同时，我想把我看过的书分享给你们，自古以来都说书中住着有趣的灵魂，我也希望我们都可以变成有趣的人,当然，阅读带给我们的乐趣远不仅仅是这些，从书中我们可以读到不一样的人生，看到不一样的风土人情，理解生活中不能理解的事情，有更开阔的思维，有看不见却能感知的不可名状的力量。当然，一千个读者眼里有一千个哈姆雷特，你从书中看到的世界就是你自己的生活，尝试着去阅读，也许你会看到更多不一样的乐趣。书评会隔一段时间更新一次，还有我觉得比较好的书也会推荐给大家，希望我们共同进步。最后还是啰嗦一句，如果有任何想法，就去行动，你明天永远换不来今天。我认识一个朋友15年的时候说要考驾照，可是现在我们都拿本了，她还是没有去考。就在刚刚发生在我自己的身上的事情，我计划报考资质证书考试，但我吊儿郎当还是错过了报考时间。欢迎大家来叶子博客跑堂儿，有任何问题咨询，发邮件给我就行',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '60',
    'islike': true,
    'img': './aboutbook.jpg'
}, {
    'title': '当时一样雨1.0上线了',
    'content': '一开始我计划着用wordpress搭建个人网站，后来从官方上下载源码，着手准备wp 的编程之旅。正处于兴奋的时候，我发现了另一个小巧轻便的框架thinkjs，于是我还是按耐不住好奇心，整整花了一周时间，利用上班的空闲时间，在公司的电脑上搭建虚拟机环境，安装nodejs，安装thinkjs，顺理成章的玩着新框架。各种看文档，各种看视频，索性框架依旧遵循着mvc 的思想，只是写法不一样，所以简单的数据操作还是很容易。当然，最后改版的博客还是没有用上，一开始我觉得自己写的功能点不是很多，所以换框架是一件很容易的事。但事实证明我想错啦，功能点太多，细节也不完善，重新开工的话，自己没有很多的精力。所以web2.0版本，在原来的基础上增加了部分功能，对所传参数做了相应验证，并且更改了原来框架的结构，使用了静态化页面缓存。当然页面模版也更换了。前一段时间，自己一直处于迷茫状态中，不知如何是好。家里的事，工作的事，生活的事，各种各样的状况出现。说好的九月份上线，我自己一直没空更新源码。后来在知乎上看到一句话，何必浪费时间烦恼，等时光飞逝一事无成之际你才真正的感慨万千。好吧，没有过不去的火焰山。',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '60',
    'islike': false,
    'img': './blogv1.jpg'
}, {
    'title': '关于淘宝屋',
    'content': '淘宝屋是今天刚上线的一个栏目，最近特别忙，忙得没有时间管理这个博客，没有时间管理淘宝店，每天不停得敲着代码，有时候，累到闭着一只眼睛在敲，每天最期望得就是可以睡一个懒觉，没有太多奢望，只是奢望阳光可以充足一点，生活可以更美好一点，在键盘上敲打文字可以更随心所欲一些。每每周末，暂且忘记自己的职业，给自己内心放四十八小时的假期。做一些自己想做的事情，写写文字，发发感慨，不期望成为名噪一时的大作家，只是我手写我心；养养花草，溜溜小狗，不期望成为淡泊名利的归隐人士，只是我情寄我心。生活其实就是这么简单，没有太多舍不得，拥有太多总会患得患失，或许别人所说得失去比拥有更踏实是至理名言。闲暇的时候，想一些自己想念的人，腾出十分钟的时间，时常问候一下父母，也许老人总是在你不在家的时候，看着照片想念儿时玩闹的你。世上最不能等得事情就是孝顺父母，所以我在淘宝小屋主页上加了温馨提示，常回家看看。有些人总是以各种理由说，我忙，特别忙，忙得给父母打个电话的时候也没有。我的小妹就是这样，老妈时常打电话抱怨说，果果忙得连个电话都不给我打。我听着电话那头的叹息声，我也不知道安慰什么，只觉得心里特别难受，总是父母惦记着儿女，儿女却在欢笑中遗忘他们。',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '60',
    'islike': false,
    'img': './taobaowu.jpg'
}, {
    'title': '关于友情链接',
    'content': '申请当时一样雨网站的友情链接童鞋们：申请步骤如下：1、首先在贵站做好当时一样雨的文字友情链接，叶子博客链接：2、其次在首页的Blog留言中，留下贵站的名称、网站url等。3、申请叶子博客网站的友情链接不得包含反动或黄色违法信息，内容健康，符合本站友情链接要求的网站，即可由站点管理员操作添加贵站的友情链接，并显示在页面上。4、友情链接本站博主会定时得更新，那些优秀的博客链接一直会保留在页面上，便于访问与学习。5、如果你无意间走进本站，或许有什么文字吸引到你，无论怎样，来者是客，博主热烈欢迎。【注】当时一样雨网站不再交换友请链接！',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '60',
    'islike': false,
    'img': './flink.jpg'
}, {
    'title': '关于博客',
    'content': '认认真真写一下关于博客，当初建立博客的时候，那时我还处在学写程序的初步阶段。所谓的零基础，就是什么都不会。那个时候面对代码，我就觉得像面对恶魔一样，内心充满了恐惧和不安。我每天都在想，我是不是就不是敲代码的料，我是不是没那个脑子，我每天处于自我怀疑和自我否定的那个黑洞里，想逃却逃不出来。因为我从小就特别写文字，朋友建议我要不要去做编辑，干脆就忘记写程序吧。我执拗得说不，为什么要放弃，如果你现在处于我那时的纠结状态，请你继续加油，因为那段特别痛苦的时光正是破茧成蝶的时候，一定不要轻易说放弃，一定不要轻易的否定自己。写一下我整这个博客的初衷吧，那时经理让我做个新闻系统，利用现有的框架弄一个新闻的前后台出来，当前是规定了时间，一周完成。那时候，和我同组的那个女生和我一样，什么也不会，经理的想法就是，谁做出来，谁留下，做不出来就可以走人了。我这种执拗得性格，是绝对不可能灰头土脸的走人的。不想走的话，就自己研究代码。在什么都不会的情况，抓瞎的状态，我还是如期的完成了前后台功能。这个博客最初的原型，就是我第一个做的项目。为了纪念这深刻难忘的记忆，我决定把这个博客一直做下去，更新自己的心情，分享自己眼里看到的，书中读到的，工作中遇到的，于我而言把我所知道的分享给大家也是一种荣幸。此博客旨在发扬矫情见怪不怪，语不雷人死不休的风格。意在感慨春夏秋冬四季更迭，人生路上变幻莫测的波澜，念在激起键盘指尖充满灵性的火花，忆在学堂落拓而纯粹的美好年华，写在不起任何涟漪的时光里对着电脑碎碎念，如你喜欢此博客的风格或内容，分享给你身边的朋友或同学。',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '60',
    'islike': false,
    'img': './aboutblog.jpg'
}, {
    'title': '关于博主',
    'content': '男，九零后，IT男，狮子座，IT界最不着调的程序员，、旅行、滑旱冰、吃零食、喝七喜、各种奇奇怪怪的想法，九零后，IT boy，手机控，电脑控，喜欢听杰伦的歌，看小四的煽情文字，用自嘲的手法写自己的生活历程。喜欢像海一样蓝的天空，喜欢海风吹在脸上轻柔的感觉，喜欢漫无目的得去陌生的城市，喜欢不计后果的矫情，喜欢狂欢后一个人承受呼啸而来的孤单。我就是这么霸气的妹纸，可直可弯能屈能伸，卖得了萌，耍得了二，扮得了纯情少女，演得了霸气女王，玩得了小清新，斥退过死皮赖脸的无知少年。躲得过不怀好意的搭讪大叔，你讲笑话我可以拍桌大笑，你要玩文艺我就仰望星空。  ',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '60',
    'islike': false,
    'img': './aboutme.jpg'
}]


export const Indexarticles = [{
    'title': '记录地铁一幕',
    'content': '晚上下班回家，坐地铁的时候，看见一个男生，约莫二十出头的年纪，他一边打电话一边啜泣，他说今天一天都在公司培训，没有时间看手机。故意压低沙哑的嗓音，说一切都好，让听筒对面的那个人放心。我不知道电话对面那个人是谁，是父母，还是爱人，总之是他在意的人，他一接起电话，眼泪就流下来了。他低着头，努力掩饰着那个真实的自己。挂掉电话，他一直在沉思，依旧抽泣着，好像比刚才更悲伤了。我抬头看了看周围那些陌路人，疲惫的神态里藏着他们自己的故事，挂着淡淡的微笑，藏匿着说不出的无奈。我知道，没有人会注意这些，低着头玩消消乐的那个姑娘，一关又一关的闯着；还有那个挎着紫色的背包的那个大姐，手扶着把手，摇摇晃晃的撞到了身边的人，很歉意得摆摆手；还有那个嚷着吃糖果的小女孩，扎着可爱的冲天辫，咿咿呀呀得喊着糖，糖，摇晃着妈妈的手，妈妈宠溺地看着闺女，摸摸她的头，说下了地铁就给她买',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '362',
    'islike': true,
    'img': './img/subway.jpg',
    'type': '韶华追忆'

}, {
    'title': '《活着》书评',
    'content': '前一段时间，利用晚上空闲时间看完的。我和同事说，我要看《活着》这本书，听别人说这是一本让人绝望的书。同事说，你在孕期中，就不要看这么悲观的书了。我说没有绝望哪来的希望，我还是执拗的翻开这本书，印入眼帘的一个枯瘦的老人，拉着一头老黄牛，在夕阳西下讲着曾经好几十年前发生的事，这个老人叫富贵。从前的他是一个纨绔子弟，整天出入于赌场，家产败光了，爹被气死了，一下子由阔少爷变成一个穿粗布破衫的平民老百姓。本想着安稳的过过穷苦日子，下田耕地，一辈子就这样平平淡淡的过着也挺好。可谁知，娘病了，去城里找郎中的途中被抓了壮丁，一走好几年，没有了音信。过了几年，摸爬滚打死里逃生回来了，女儿凤霞却哑了，记得离家的时候凤霞扯着衣角嚷嚷着爹爹，可如今却不会说话了。苦难总是来得猝不及防，可总归是活着有点盼头。儿子有庆已长大了，一双儿女，破败的茅屋，困难里还是有甜甜的味道。在那个年代，经历了人民公社，大炼钢铁，文化大革命，闹饥荒，所有的一切似乎命中注定的砸到富贵这一家人身上。儿子有庆突然死去，富贵不愿告诉生病的妻子，一个人抱着有庆冰凉的身体，他不曾想，曾经那个脱掉鞋子跑步跑的飞快的小伙子一下子就没了，那个疼惜羊羔每天都去喂草的小伙子没了，就这样没了，他感慨着老天不公，生命无常。月亮照在路上，像是洒满了盐，那种伤口上撒盐的比喻似乎是为他量身定制，他狠自己没有在有庆活着的时候疼惜他，他责备懊悔都无济于事，当生命结束的那一刻，就如烛台前的蜡烛一样，灭了就是灭了。我强忍着泪水继续读，读到凤霞生娃大出血也没有命，再也看不下去了，命运多么不公，生命里的难得的温情被一次次撕扯的粉碎。凤霞走了，家珍走了，凤霞的丈夫在一次出工的时候也走了，独留下一个苦命的儿苦根。苦根跟着外公，他还不知道什么是苦难，什么是死亡，他只知道现在疼他爱他的只有外公一个人了。可是独留的苦根也走了，留给富贵的只有一生的回忆，一世的孤独。他用自己积攒的钱买了一头老黄牛，那头老黄头成了富贵倾诉的对象，他总是喊着有庆，凤霞，家珍的名字，每一个名字都是一段温情，曾经拥有的时候，他不懂的珍惜，可如今那份温情成了追忆的年华，他却迫切的想抓住。',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '520',
    'islike': false,
    'img': './img/live.jpg',
    'type': '书屋'
}, {
    'title': '记录心情-好好生活',
    'content': '许久没更新心情了，写一下最近的状态。四个字，特别不好。脾气越来越火爆，一点就着的感觉。在一个公司待久了，看到的没有惊喜和意外，所有的糟粕和不堪倾泻而来。接触了整个组百分之八十的业务，堪称酱油党的战斗机。即使你写了很多项目，写了很多脚本，效率越高越觉得你可以写更多的项目，更多的脚本。反而天天磨羊工的同事，花了大半年时间完成一个小需求，对于领导来说真是可喜可贺值得嘉奖。有时候觉得蛮不公平，可又觉得自己心态不好，反复在这种纠结和矛盾中挣扎，把内心的一些想法写出来或许对自己好一点。在公司中，你会遇到各种各样的人，真的用千奇百怪来形容都不为过。大部分的时候，我都是对事不对人，都是出来混口饭吃，何必为难别人。我这个人有点矫情从不委屈自己而去迁就别人，有人怼我，我就当面怼回去，然后继续乐呵乐呵敲着代码，有时候帮组里女生配置一下服务器环境。你会碰到耍小孩子气的产品，需求说不清道不明，开会的时候充当诸葛孔明，巴拉巴拉说一堆，一句话也没有在点上，偶尔还借着女生的优势，学着林妹妹的梨花带雨，一哭一下午。大家都是拿着工资工作，是为了解决问题而沟通的。如果哭可以解决一切问题的话，孟姜女恐怕得统一全世界。会哭的孩子有奶吃，嚎一嗓子确实有效，技术部的码农立马被叫到会议室训话。你会碰到添堵的项目经理，动不动就说我要去找你领导。你会碰到挖坑的对接人，奇怪狮子吼的产品经理，碰到多么难解的问题都会说好的得领导，你还会碰到不会订饭，只知道催进度开会的项目。你会遇到中文名缩写的命名，你会发现git打标签永远不加当前时间，你会发现自己看到的问题越来越多，然后就开始怀疑人生。我是谁，我在哪儿，我到底在干啥。',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '460',
    'islike': true,
    'img': './img/mod.jpg',
    'type': '韶华追忆'
}, {
    'title': '关于友情链接',
    'content': '申请当时一样雨网站的友情链接童鞋们：申请步骤如下：1、首先在贵站做好当时一样雨的文字友情链接，叶子博客链接：2、其次在首页的Blog留言中，留下贵站的名称、网站url等。3、申请叶子博客网站的友情链接不得包含反动或黄色违法信息，内容健康，符合本站友情链接要求的网站，即可由站点管理员操作添加贵站的友情链接，并显示在页面上。4、友情链接本站博主会定时得更新，那些优秀的博客链接一直会保留在页面上，便于访问与学习。5、如果你无意间走进本站，或许有什么文字吸引到你，无论怎样，来者是客，博主热烈欢迎。【注】当时一样雨网站不再交换友请链接！',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '60',
    'islike': false,
    'img': './flink.jpg',
    'type': '技术分享'
}, {
    'title': '好怀念小时候的满天繁星',
    'content': '曾记得，小时候过中秋节，把切开的花牙西瓜摆到大托盘里，放着各种水果，还有自家制作的月饼，小孩子不能偷吃，这个托盘的所有是供月亮品尝的。我总是傻傻得问老妈，月亮会吃月饼吗？我的母亲大人，很诚实的告诉我，傻孩子，月亮肯定不会吃，这是自古以来传下来的风俗！我反问她，难道不是迷信？她撇撇嘴说，出去看月亮吧，又大又圆。于是我手拿一个红糖饼，搬个小凳子，盯着那皎洁的月光发着呆做着梦，一觉醒来我已长大成人了。曾记得，小时候七夕那天，爸爸总是会说今天的喜鹊都要飞走了，去给牛郎织女搭桥去了。那天晚上，我总会抬头，看那银河之上，是否可以看到喜鹊的身影。',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '60',
    'islike': false,
    'img': './img/star.jpg',
    'type': '韶华追忆'

}, {
    'title': '2019年新启程',
    'content': '新的一年又开始了，首先祝福大家新年快乐，新年旺气冲天。回顾18年，似乎一年里平平淡淡，除了空闲时间爬爬山，逛逛街，好像没有别的了。18年买了属于自己的房子，虽然掏空了所有积蓄，可还是比较励志。哥哥说靠自己奋斗，硬气。在1/年的时候，也硬气了一把，挺直腰杆在这华丽的城市中打拼着，艰难而充实着过着每一天。19年的计划就是玩玩玩，趁年轻体验不同城市的美，去看一望无际的草原，去看憨态可掬的大熊猫，去体会不同的风土人情，去感受同一片天空下，每个人都活得那么努力。我愿做那颗夜空中的那个星，祈祷身边的人平平安安。',
    'date': '2019-08-09',
    'commentcount': '10',
    'visitcount': '6970',
    'likecount': '60',
    'islike': false,
    'img': './img/new2019.jpg',
    'type': '韶华追忆'
}]